#   Задача 42: Узнать какая максимальная households в зоне минимального значения population.

import pandas as pd

a = pd.read_csv('sample_data/california_housing_train.csv')   #  считываем файл

print([['population']==f['population'].min()]f[f['['households'].max())

#  https://colab.research.google.com/drive/1cy4B-3peyRjmzBCYh__1AcTPNx8_r78N?usp=sharing